1С_Профессионал_подготовка_к_сдаче/src/DataProcessors/Тестирование/Тестирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Тестирование</name>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

1С_Профессионал_подготовка_к_сдаче/src/Catalogs/Вопросы/Вопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1С_Профессионал_подготовка_к_сдаче/src/DataProcessors/Тестирование/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СертификатПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Тема) Тогда
		Возврат;
	КонецЕсли;
	УдалитьСозданныеЭлементыФормы(ЭтаФорма);
	ПодготовитьФормуДляТестирования(ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьФормуДляТестирования(Форма)
	//Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	//Элементы.Декорация1
	ГруппаСтраницы = Элементы.Добавить("ГруппаСтраницы", Тип("ГруппаФормы"), Форма);
	ГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВопросыВариантыОтветов.Ссылка КАК Вопрос,
		|	ВопросыВариантыОтветов.Ответ,
		|	isnull(ВопросыВариантыОтветов.Правильный, Ложь) Как Пометка
		|ИЗ
		|	Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
		|ГДЕ
		|	ВопросыВариантыОтветов.Ссылка.Родитель В Иерархии (&Родитель)
		|	И
		|	НЕ ВопросыВариантыОтветов.Ссылка.ПометкаУдаления
		|ИТОГИ
		|ПО
		|	Вопрос";
	
	Запрос.УстановитьПараметр("Родитель", Форма.Тема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВопрос = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерГруппы = 1;
	Пока ВыборкаВопрос.Следующий() Цикл
		ГруппаВопрос = Элементы.Добавить("ГруппаСтраница" + НомерГруппы, Тип("ГруппаФормы"), ГруппаСтраницы);
		ГруппаВопрос.Вид = ВидГруппыФормы.Страница;
		ГруппаВопрос.Заголовок = "Вопрос " + НомерГруппы;
		ГруппаВопрос.ОтображатьЗаголовок = Истина;

		Декорация = Элементы.Добавить("Декорация" + НомерГруппы, Тип("ДекорацияФормы"), ГруппаВопрос);
		Декорация.Заголовок = ВыборкаВопрос.Вопрос; 
		
		ДобавляемыеРеквизиты = Новый Массив;
		Реквизит = Новый РеквизитФормы("ВариантыОтветов" + НомерГруппы, Новый ОписаниеТипов("СписокЗначений"), , "Варианты ответов");
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭлементСписокЗначений = Элементы.Добавить("ВариантыОтветов" + НомерГруппы, Тип("ТаблицаФормы"), ГруппаВопрос);
		ЭлементСписокЗначений.ПутьКДанным = "ВариантыОтветов" + НомерГруппы;
		//ЭлементСписокЗначений.КоманднаяПанель
		
		Элемент = Элементы.Добавить("ВариантыОтветовЗначение" + НомерГруппы, Тип("ПолеФормы"), ЭлементСписокЗначений);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "ВариантыОтветов" + НомерГруппы + ".Значение";
		Элемент = Элементы.Добавить("ВариантыОтветовПометка" + НомерГруппы, Тип("ПолеФормы"), ЭлементСписокЗначений);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ПутьКДанным = "ВариантыОтветов" + НомерГруппы + ".Пометка";
				
		ВыборкаДетальныеЗаписи = ВыборкаВопрос.Выбрать();
		
		СписокЗначений = Форма["ВариантыОтветов" + НомерГруппы];
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокЗначений.Добавить(ВыборкаДетальныеЗаписи.Ответ);
		КонецЦикла;
		
		НомерГруппы = НомерГруппы + 1;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьСозданныеЭлементыФормы(Форма)
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		ф = 1;
	КонецЦикла;
КонецПроцедуры
